In [3]:
val ='a,b,guido'
val.split(',')
pieces =[x.strip() for x in val.split(',')]
'::'.join(pieces)

'a::b::guido'

In [8]:
#数据加工：连接合并整形
# Hierarchical Indexing（分层索引）
import pandas as pd
import numpy as np
data =pd.Series(np.random.randn(9)
               ,index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,2,1,2,2,3]])
data

a  1    1.636866
   2    0.318438
   3   -0.552059
b  1    0.550561
   2   -0.630200
c  1   -0.323446
   2    0.378776
d  2   -0.014171
   3    0.139988
dtype: float64

In [9]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 0, 1, 1, 2]])

In [10]:
data['b']

1    0.550561
2   -0.630200
dtype: float64

In [11]:
data['b':'c']

b  1    0.550561
   2   -0.630200
c  1   -0.323446
   2    0.378776
dtype: float64

In [13]:
data.loc[:,2]

a    0.318438
b   -0.630200
c    0.378776
d   -0.014171
dtype: float64

In [ ]:
分层索引的作用是改变数据的形状，以及做一些基于组的操作（group-based）比如做一个数据透视表（pivot table）。
例子，我们可以用unstack来把数据进行重新排列，产生一个DataFrame：

In [15]:
data.unstack()

          1         2         3
a  1.636866  0.318438 -0.552059
b  0.550561 -0.630200       NaN
c -0.323446  0.378776       NaN
d       NaN -0.014171  0.139988

In [16]:
data

a  1    1.636866
   2    0.318438
   3   -0.552059
b  1    0.550561
   2   -0.630200
c  1   -0.323446
   2    0.378776
d  2   -0.014171
   3    0.139988
dtype: float64

In [17]:
data.unstack().stack()

a  1    1.636866
   2    0.318438
   3   -0.552059
b  1    0.550561
   2   -0.630200
c  1   -0.323446
   2    0.378776
d  2   -0.014171
   3    0.139988
dtype: float64

In [27]:
#对于任何一个DataFrame,任何axis都可以有一个分层索引
frame=pd.DataFrame(np.arange(12).reshape((4,3)),
                  index=[['a','a','b','b'],[1,2,1,2]],
                  columns =[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [23]:
frame['Ohio']

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

In [28]:
# 1 Reordering and Sorting Levels（重排序和层级排序）

有时候我们需要在一个axis（轴）上按层级进行排序，或者在一个层级上，根据值来进行排序。swaplevel会取两个层级编号或者名字，
并返回一个层级改变后的新对象（数据本身并不会被改变）：

SyntaxError: invalid character in identifier (<ipython-input-28-f717aa12be12>, line 3)

In [32]:
frame.swaplevel('key1','key2')
frame.sort_index(level=1)
#（按照我的理解，level指的是key1和key2，key1是level=0，key2是level=1。可以看到下面的结果和上面是一样的：）

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [33]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [ ]:
#Summary Statistics by Level (按层级来归纳统计数据)
#在DataFrame和Series中，一些描述和归纳统计数据都是有一个level选项的，这里我们可以指定在某个axis下，
#按某个level（层级）来汇总。比如上面的DataFrame，我们可以按 行 或 列的层级来进行汇总：

In [34]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [37]:
frame.sum(level=1)

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [38]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [41]:
frame=pd.DataFrame({'a':range(7),'b':range(7,0,-1),
                  'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                  'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [43]:
frame2=frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [45]:
frame3=frame.set_index(['c','d'],drop=False)
frame3

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [46]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1